Revit 2026 API

# RebarConstraintIsBindingHandleWithTarget Method

---

Gets the relationship between two RebarConstrainedHandles.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsBindingHandleWithTarget()
```
```vb
Public Function IsBindingHandleWithTarget As Boolean
```
```cpp
public:
bool IsBindingHandleWithTarget()
```
```fsharp
member IsBindingHandleWithTarget : unit -> bool
```

#### Return Value

Boolean Returns False if only the constrained RebarConstrainedHandle follows the target. Returns True if the constrained RebarConstrainedHandle and the target bar handle are bound and move together.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | RebarConstraint is no longer valid. -or- The RebarConstraint is not of RebarConstraintType 'ToOtherRebar'. -or- The RebarTargetConstraintType is 'HookBend' or 'BarBend'. -or- The RebarTargetConstraintType is 'OutOfPlaneExtent' and the rebar target layout is 'Number with Spacing'. |

Throws exception for any type of constraint other than 'ToOtherRebar' or if the RebarTargetConstraintType of the constraint is 'HookBend' or 'BarBend'. Will also throw if the target Rebar has the 'Number with Spacing' layout rule and the RebarTargetConstraintType of the constraint is 'OutOfPlaneExtent'.

#### Reference

RebarConstraint Class

Autodesk.Revit.DB.Structure Namespace